In [18]:
import sqlite3

In [23]:
db=sqlite3.connect("student_database final new.db")

In [24]:
cur=db.cursor()

In [25]:
cur.execute("create table student(id int primary key,name text,marks int)")

OperationalError: table student already exists

In [27]:
cur.execute("insert into student(id,name,marks) values(1,'john',90)")
db.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [12]:
print(cur.rowcount,"record(s) inserted")

-1 record(s) inserted

In [8]:
cur.execute("insert into student(id,name,marks) values(2,'teena',100)")
db.commit()

In [9]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)

In [10]:
cur.execute("insert into student(id,name,marks) values(3,'andrew',110)")
db.commit()

In [11]:
cur.execute("insert into student(id,name,marks) values(4,'dor',45)")
db.commit()

In [12]:
cur.execute("insert into student(id,name,marks) values(5,'surt',55)")
db.commit()

In [13]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)

In [14]:
cur.execute("insert into student values (9,'kia',23),(10,'abj',93),(11,'tam',88)")
db.commit()
print (cur.rowcount,"Record(s) inserted")

3 Record(s) inserted

In [15]:
results=cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [16]:
results=cur.execute("select id,name from student")
for i in results:
    print(i)

(1, 'john')
(2, 'teena')
(3, 'andrew')
(4, 'dor')
(5, 'surt')
(9, 'kia')
(10, 'abj')
(11, 'tam')

In [17]:
results=cur.execute("select id,marks from student")
for i in results:
    print(i)

(1, 90)
(2, 100)
(3, 110)
(4, 45)
(5, 55)
(9, 23)
(10, 93)
(11, 88)

In [18]:
results=cur.execute("select * from student where id=1")
for i in results:
    print(i)

(1, 'john', 90)

In [19]:
results=cur.execute("select * from student where id=2")
for i in results:
    print(i)

(2, 'teena', 100)

In [20]:
results=cur.execute("select * from student where name='john'")
for i in results:
    print(i)

(1, 'john', 90)

In [21]:
results=cur.execute("select marks from student where name='john'")
for i in results:
    print(i)

(90,)

In [22]:
results=cur.execute("select * from student limit 3")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)

In [23]:
results=cur.execute("select * from student where marks>60 and marks <90")
for i in results:
    print(i)

(11, 'tam', 88)

In [24]:
results=cur.execute("select * from student where marks>40 and marks <60")
for i in results:
    print(i)

(4, 'dor', 45)
(5, 'surt', 55)

In [25]:
results=cur.execute("select * from student")
results.fetchall()

[(1, 'john', 90),
 (2, 'teena', 100),
 (3, 'andrew', 110),
 (4, 'dor', 45),
 (5, 'surt', 55),
 (9, 'kia', 23),
 (10, 'abj', 93),
 (11, 'tam', 88)]

In [26]:
results=cur.execute("select * from student order by name asc")
for i in results:
    print(i)

(10, 'abj', 93)
(3, 'andrew', 110)
(4, 'dor', 45)
(1, 'john', 90)
(9, 'kia', 23)
(5, 'surt', 55)
(11, 'tam', 88)
(2, 'teena', 100)

In [27]:
results=cur.execute("select * from student order by name desc")
for i in results:
    print(i)

(2, 'teena', 100)
(11, 'tam', 88)
(5, 'surt', 55)
(9, 'kia', 23)
(1, 'john', 90)
(4, 'dor', 45)
(3, 'andrew', 110)
(10, 'abj', 93)

In [28]:
results=cur.execute("select * from student where name='dor'and marks=45")
for i in results:
    print(i)

(4, 'dor', 45)

In [30]:
results=cur.execute("select * from student where name='dor'and marks=55")
for i in results:
    print(i)

In [31]:
results=cur.execute("select * from student where id=2 and marks=100")
for i in results:
    print(i)

(2, 'teena', 100)

In [32]:
results=cur.execute("select min (marks)from student ")
for i in results:
    print(i)

(23,)

In [33]:
results=cur.execute("select max (marks)from student ")
results.fetchone()

(110,)

In [34]:
results=cur.execute("select avg(marks)from student ")
results.fetchone()

(75.5,)

In [35]:
results=cur.execute("select sum(marks)from student ")
results.fetchone()

(604,)

In [36]:
results=cur.execute("select count(id)from student ")
results.fetchone()

(8,)

In [54]:
results=cur.execute("select * from student where marks between 55 and 85")
for i in results:
    print(i)

(5, 'surt', 55)

In [38]:
results=cur.execute("select * from student where marks is null")
for i in results:
    print(i)

In [39]:
results=cur.execute("select * from student where marks is not null")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [40]:
results=cur.execute("select * from student where name like 'd%'")
for i in results:
    print(i)

(4, 'dor', 45)

In [41]:
results=cur.execute("select * from student where name like '_i%'")
for i in results:
    print(i)

(9, 'kia', 23)

In [42]:
results=cur.execute("select * from student where name like '%r'")
for i in results:
    print(i)

(4, 'dor', 45)

In [43]:
results=cur.execute("select * from student where name like '%r%'")
for i in results:
    print(i)

(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)

In [44]:
results=cur.execute("select * from student where name like '___'")
for i in results:
    print(i)

(4, 'dor', 45)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [45]:
results=cur.execute("select * from student where marks NOT in(70)")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 45)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [46]:
results=cur.execute("select * from student where name NOT in('dor')")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [47]:
sql="update student set marks=81 where id=4"
cur.execute(sql)

In [48]:
results=cur.execute("select * from student where id=4")
for i in results:
    print(i)

(4, 'dor', 81)

In [49]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 100)
(3, 'andrew', 110)
(4, 'dor', 81)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [50]:
sql="update student set marks=105 where id in (2,3)"
cur.execute(sql)

In [51]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 105)
(3, 'andrew', 105)
(4, 'dor', 81)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)

In [52]:
sql="delete from  student where id=4"
cur.execute(sql)

In [53]:
results=cur.execute("select * from student")
for i in results:
    print(i)

(1, 'john', 90)
(2, 'teena', 105)
(3, 'andrew', 105)
(5, 'surt', 55)
(9, 'kia', 23)
(10, 'abj', 93)
(11, 'tam', 88)